function createFormFromJSON() {
  var form = FormApp.getActiveForm();

  var jsonData = {
    "title": "Оценка на използваните дигитални ресурси и платформи при обучението на учениците в общообразователно училище",
    "description": "Уважаеми колеги, Пред Вас е въпросник „Оценка на използваните дигитални ресурси и платформи при обучението на учениците в общообразователно училище“, който има за цел да проучи вашата удовлетвореност от използването на дигитални ресурси и платформи в преподавателската ви работа. \n Вашите отговори са важни за достоверното провеждане на научно изследване, което има за цел да повиши качеството на използваните учебни дигитални ресурси и платформи. Резултатите ще бъдат представени на Трета национална научно-практическа конференция „Дигитална трансформация на образованието - проблеми и решения“, която ще се проведе на 24 - 25 април 2025 г. в Русенския университет „Ангел Кънчев“. Въпросникът е анонимен. Попълването му отнема около 5-10 минути. \n Предварително Ви благодарим за участието! Настоящата анкета има за цел да проучи вашата удовлетвореност от използването на дигитални ресурси и платформи в преподавателската практика.",
    "questions": [
      {
        question: "Учебната дисциплина, по която преподавате е:",
        type: "short_answer"
      },
      {
        "question": "В кой образователен етап преподавате?",
        "type": "multiple_choice",
        "options": ["Начален (1-4 клас)", "Прогимназиален (5-7 клас)", "Гимназиален (8-12 клас)", "Друго"]
      },
      {
        "question": "Вашият преподавателски опит е:",
        "type": "multiple_choice",
        "options": ["По-малко от 1 година", "1-5 години", "6-10 години", "Над 10 години"]
      },
      {
        "question": "Институцията, в която преподавате е:",
        "type": "multiple_choice",
        "options": ["държавна/общинска", "частна", "друго"]

      },
      {
        "question": "Според вида на подготовката институцията, в която преподавате е:",
        "type": "multiple_choice",
        "options": ["начално училище (I – IV клас включително)", "основно училище (I – VII клас включително)", "обединено училище (I – X клас включително)", "средно училище (I – XII клас включително)", "гимназия (VIII – XII клас включително)", "профилирана гимназия", "професионална гимназия", "специализирано училище (спортно, по културата, по изкуствата, духовно училище)", "частна школа (за извънучилищни дейности)", "Друго"]
      },
      {
        "question": "Населеното място, в което преподавате е:",
        "type": "short_answer"
      },
      {
        "question": "Каква е вашата възраст?",
        "type": "miltiple_choice",
        "options": ["до 30 години", "между 30 - 40 години", "между 40 - 50 години", "над 50 години"]
      },
      {
        "question": "Вашият пол е:",
        "type": "multiple_choice",
        "options": ["мъж", "жена"]
      },
      {
        "question": "Колко често използвате дигитални ресурси в работата си?",
        "type": "multiple_choice",
        "options": ["Всеки ден", "Няколко пъти седмично", "Веднъж седмично", "По-рядко", "Никога"]
      },
      {
        "question": "За какво използвате дигиталните ресурси?",
        "type": "checkbox",
        "options": ["Провеждане на уроци", "Подготовка на учебни материали (образователно съдържание)", "Комуникация с учениците", "Оценяване и анализ на знания и умения", "Предоставяне на обратна връзка", "Създаване на авторски дигитални уроци със собствени учебни материали", "Създаване на онлайн тестове", "Проучване на информация", "Превод", "Анализ на данни", "Генериране на идеи", "Друго (моля, уточнете): ________", "Не използвам дигитални ресурси."]
      },
      {
        "question": "Kои от изброените дигитални платформи и инструменти използвате? Оценете ги според описаните критерии.",
        "type": "grid",
        "rows": ["Google Classroom", "Moodle", "Edmodo", "Schoology", "Zoom", "Google Meet", "Microsoft Teams", "Webex", "Padlet", "Canva", "Wakelet", "Genially", "Book Creator", "Kahoot!", "Quizizz", "Mentimeter", "Nearpod", "Pear Deck", "Scratch", "Tinkercad", "Code.org", "PhET Interactive Simulations", "Duolingo", "BBC Bitesize", "Quizlet", "StoryJumper", "Project Gutenberg", "LibriVox", "StoryWeaver", "Khan Academу", "Classdojo", "Flipgrid", "ChatGPT", "Bing Chat", "Bard", "Perplexity", "Pi", "DALL-E", "Stable Diffusion", "Midjourney", "Bing Image Creator", "Synthesia", "PlayHT", "Друго (моля уточнете): _______"],
        "columns": ["Лесен за използване", "Полезен за преподаване", "Интерактивен", "Приложим в различни уроци", "Не използвам"]
      },
      {
        "question": "Според Вас какво е влиянието на дигиталните технологии върху начина, по който учат Вашите ученици?",
        "type": "checkbox",
        "options": ["Използват ги за същите дейности, изпълнявани преди.", "Носят функционални подобрения в начина на учене и подготовка на домашната работа.", "Учениците работят самостоятелно.", "Учебното съдържание е по-достъпно за учениците.", "Мотивацията за учене се е повишила.", "Мотивацията за учене остава без промяна.", "Мотивацията за учене намалява.",]
      },
      {
        "question": "До каква степен използването на дигитални ресурси е подобрило Вашата преподавателска работа?",
        "type": "multiple_choice",
        "options": ["Значително е подобрило работата ми", "Леко е подобрило работата ми", "Няма разлика", "Направило е преподаването по-сложно", "Друго: ___________",]
      },
      {
        "question": "Институцията, в която работите предлага ли STEAM център?",
        "type": "multiple_choice",
        "options": ["Да, но центърът не е подходящ за дисциплините, които преподавам.", "Да, и аз провеждам уроци в него.", "Няма.", "В процес на разработване е.",]
      },
      {
        "question": "С кои от изброените дисциплини реализирате междупредметни връзки във вашите уроци чрез използването на дигитални ресурси:",
        "type": "checkbox",
        "options": ["Български език", "Литература", "Чужд език", "Математика", "Родинознание", "Музика", "Изобразително изкуство", "Технологии и предприемачество", "Физическо възпитание и спорт", "Човекът и обществото", "Човекът и природата", "Компютърно моделиране", "История и цивилизации", "География и икономика", "Биология и здравно образование", "Физика и астрономия", "Химия и опазване на околната среда", "Философия", "Информационни технологии", "Гражданско образование",]
      },
      {
        "question": "Според Вас какво е влиянието на дигиталните технологии върху Вашата преподавателска работа?:",
        "type": "multiple_choice",
        "options": ["Използвам ги за същите дейности, изпълнявани преди.", "Носят функционални подобрения в работата ми.", "Преобразяват класната стая и организацията на уроците. ", "Позволяват използването на нов подход, който е бил невъзможен без тях.",]
      },
      {
        "question": "Кои от следните предизвикателства срещате при използването на дигитални платформи?",
        "type": "checkbox",
        "options": ["Технически проблеми и трудности", "Липса на време за подготовка за работа с платформите", "Слаба интернет връзка", "Ниска дигитална грамотност на учениците", "Липса на подходящи обучения за работа с платформите", "Липса на достъп до повече дигитални ресурси", "Друго (моля, уточнете): ________",]
      },
      {
        "question": "Каква е вашата оценка за обучението на учениците ви чрез дигитални ресурси и платформи?",
        "type": "multiple_choice",
        "options": ["Да, ще бъдат основни в учебния процес.", "Да, но в комбинация с традиционните методи.", "Не съм сигурен/а.", "Не, няма да имат съществена промяна.",]
      },
      {
        "question": "Желаете ли да участвате в допълнителни обучения за ефективно използване на дигитални ресурси?",
        "type": "multiple_choice",
        "options": ["Да, предпочитам онлайн обучение.", "Да, предпочитам присъствено обучение.", "Не.",]
      },
      {
        "question": "За какъв тип дигитални ресурси бихте искали да получите обучения?",
        "type": "checkbox",
        "options": ["Работа с конкретни платформи.", "Дигитални инструменти за оценяване и обратна връзка.", "Създаване на интерактивни уроци.", "Създаване на изображения и дизайн, музика, аудио, видео, презентации", "Чат ботове", "Платформи за програмиране и STEM обучение", "Инструменти за създаване на учебно съдържание", "Платформи за видеоконференции", "Управление на обучението (LMS) и електронни дневници", "Други: ___________", "Не желая обучения.",]
      }
    ]
  };

  form.setTitle(jsonData.title);
  form.setDescription(jsonData.description);

  jsonData.questions.forEach(q => {
    let item;
    switch (q.type) {
      case "multiple_choice":
        item = form.addMultipleChoiceItem();
        var choices = q.options.map(option => item.createChoice(option));
        item.setTitle(q.question).setChoices(choices);
        break;
      case "checkbox":
        item = form.addCheckboxItem();
        var choices = q.options.map(option => item.createChoice(option));
        item.setTitle(q.question).setChoices(choices);
        break;
      case "scale":
        item = form.addScaleItem();
        item.setTitle(q.question).setBounds(q.scale.min, q.scale.max);
        break;
      case "short_answer":
        item = form.addTextItem();
        item.setTitle(q.question);
        break; type
      case "paragraph":
        item = form.addParagraphTextItem();
        item.setTitle(q.question);
        break;
      case "grid":
        item = form.addGridItem();
        item.setTitle(q.question);
        item.setRows(q.rows).setColumns(q.columns);
        break;
    }
  });
}